Revit 2027 API
AdvancedOpaque.OpaqueAlbedo Property
 The property labeled "Color" from the "AdvancedOpaque" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string OpaqueAlbedo { get; }
Public Shared ReadOnly Property OpaqueAlbedo As String
	Get
public:
static property String^ OpaqueAlbedo {
	String^ get ();
}
static member OpaqueAlbedo : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
AdvancedOpaque Class
Autodesk.Revit.DB.Visual Namespace